const Login = () => import('../components/Login.vue')
const Register = () => import('../components/Register.vue')
const Home = () => import('../components/Home.vue')
const notFound = () => import('../views/404.vue')
const Show = () => import('../components/home/Show.vue')
const Profile = () => import('../components/Profile.vue')
const Welcome = () => import('../components/home/Welcome.vue')

export default [
  {
    path:'/',
    redirect:'/login'
  },
  {
    path:'/login',
    component:Login
  },
  {
    path:'/register',
    component:Register
  },
  {
    path:'*',
    component:notFound
  },
  {
    path:'/home',
    component:Home,
    children:[
      {
        path:'',
        redirect:'/welcome'
      },
      {path:'/welcome',component:Welcome},
      {path:'/profile',component:Profile},
      {path:'/女生委员会',component:Show,
        alias:
        [
          '/学生公寓社区服务委员会',         '/学生声光技术团',        '/学生志愿者服务中心',
          '/学生社团联合会',             '/学生膳食监督管理委员会',    '/学生艺术团',
          '/招生服务中心',              '/星空学生创新中心',       '/校团委',
          '/校学生会',                '/国际商学院团委、学生会',    '/土木工程学院团委、学生会',
          '/外国语学院团委、学生会',         '/建筑学院团委、学生会',     '/建筑学院班级联合会',
          '/机械工程学院团委、学生会',        '/汽车交通工程学院团委、学生会', '/珠宝学院团委、学生会',
          '/电子信息工程&中兴通信学院团委、学生会', '/电气工程学院团委、学生会',   '/管理学院团委、学生会',
          '/管理学院党务办公室',           '/管理学院学生就业促进会',    '/管理学院新闻宣传中心',
          '/管理学院心晴驿站',            '/管理学院人力资源学研会',    '/管理学院学生自律委员会',
          '/管理学院茶艺社',             '/管理学院文艺团',        '/经济学院团委、学生会',
          '/经济学院学生就业促进会',         '/计算机工程学院团委、学生会',  '/WT轮滑协会',
          '/跆拳道协会',               '/毽球协会',           '/武术协会',
          '/power篮球协会',           '/游泳协会',           '/乒乓球协会',
          '/网球协会',                '/排球协会',           '/健身协会',
          '/羽毛球协会',               '/自行车协会',          '/足球协会',
          '/天文地理爱好者协会',           '/会计协会',           '/创新创业协会',
          '/日语协会',                '/学生职业发展协会',       '/工业设计协会',
          '/工商管理爱好者协会',           '/市场营销协会',         '/金融理财协会',
          '/电子商务协会',              '/礼仪文化协会',         '/粤语社',
          '/ERP沙盘协会',             '/摄影协会',           '/读者协会',
          '/I手绘协会',               '/英语协会',           '/汽车爱好者协会',
          '/法学协会',                '/创意设计协会',         '/虚拟仪器协会',
          '/机械创新协会',              '/物理爱好者协会',        '/航模协会',
          '/思辨与演讲协会',             '/虚拟现实爱好者协会',      '/计算机协会',
          '/机器人协会',               '/电子爱好者协会',        '/碳金融协会',
          '/IMP魔术协会',             '/华冕汉服社',          '/梦想天堂动漫协会',
          '/吉他协会',                '/交谊舞协会',          '/话剧社',
          '/晨曦文学协会',              '/ATP街舞协会',        '/盎然阁书法协会',
          '/缘弈棋社',                '/自强社',            '/环保协会',
          '/心里健康协会'
        ]
      }
    ]
  }
]

